InventoryService/testing/artillery.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 55
      name: "Warm up"
    - duration: 60
      arrivalRate: 100
      rampTo: 150
      name: "Ramp up"
    - duration: 60
      arrivalRate: 150
      rampTo: 300
    - duration: 60
      arrivalRate: 225
      rampTo: 450
    - duration: 60
      arrivalRate: 300
      rampTo: 600
    - duration: 60
      arrivalRate: 375
      rampTo: 800
    - duration: 60
      arrivalRate: 450
      rampTo: 1000
    - duration: 60
      arrivalRate: 500
      rampTo: 1250
    - duration: 60
      arrivalRate: 550
      rampTo: 1450
      name: "Final high load phase"
  payload:
    path: "listingsbyhosttest.csv"
    fields:
      - "listingid"
scenarios:
  - name: "Get listing info"
    flow:
    - get:
        url: "/inventory/{{ listingid }}"